{"url": "https://edition.cnn.com/2020/09/14/investing/housing-economy/index.html", "title": "The undeniable bright spot in the pandemic economy", "article": ["Mortgage applications are rising, thanks to record low rates. The Federal Reserve is planning to keep rates interest rates near zero for the foreseeable future, which will make financing even more affordable.", "\"Housing is probably going to come out as one of the winners of this crisis,\" said Esty Dwek, head of global market strategy for Natixis Investment Managers.", "\"Interest rates should remain low for even longer. So I don't expect housing to be another shoe to drop for the economy,\" Dwek added.", "Strength in the housing market has helped power the CNN Business Back-to-Normal Index as well. CNN Business partnered with Moody's Analytics to create the index, which looks at a variety of measures to judge how the economy is doing. ", "On the housing front, the index includes daily new home postings from Zillow (Z) and weekly loan applications from the Mortgage Bankers Association. ", "Low rates are one of the main reasons why home sales and prices continue to rise. What's more, the coronavirus outbreak is prompting many people in big cities to pull the plug on apartment living and buy bigger homes in less densely populated suburbs. ", "\"Rising prices are just one more reason for people to leave expensive urban neighborhoods behind,\" said Redfin (RDFN) chief economist Daryl Fairweather in a report last week.", "\"The sudden rise of remote work has allowed homebuyers who are priced out of one neighborhood to expand their search to more affordable areas,\" Fairweather added.", "The exodus to the suburbs continues", "Redfin said in its report that media home sale prices rose 13% from a year ago to nearly $320,000 -- the highest price on record. What's more, recent increases in pending home sales and new home listings were their highest since 2015.", "The housing market on the West Coast is particularly hot. According to data from housing market and real estate analytics firm Meyers Research, prices for new homes rose solidly in July in Phoenix, Denver and Las Vegas as well as Sacramento and Riverside in California.", "Meyers Research said in a report that \"low mortgage rates and the desire for more space has pushed a lot of residents into homeownership,\" and residents of the pricier Los Angeles and San Francisco areas are the ones leaving for other cities. ", "At some point though prices could become too high. Builders may want the red-hot housing market to cool off just a little bit.", "\"Land is a valuable and limited commodity. Builders need to be careful to not sell through all of their lots too quickly so many will slow sales intentionally,\" said Ali Wolf, chief economist for Meyers Research, in a report.", "\"Today's low mortgage rates allow builders to raise prices without crushing demand,\" Wolf added.", "Redfin's Fairweather is also worried that home prices could eventually become too high. That would be especially problematic for renters who don't have the advantage of cashing in on an existing home in order to trade up.", "\"Home-price growth this high is making the housing market especially difficult for first-time homebuyers right now,\" Fairweather said. \"Price growth may slow in 2021, but even if it does, high prices are going to continue to make affordability a concern for buyers.\""]}