{"url": "https://edition.cnn.com/2020/09/10/investing/premarket-stocks-trading/index.html", "title": "The pressure is off stocks ... for now", "article": ["A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.", "US futures dipped a bit on Thursday, but a feeling of calm has returned to markets. \"Like a late summer storm, the market volatility of the last few days has simply faded away,\" said Societe Generale strategist Kit Juckes.", "The VIX, a measure of market volatility, is back below 30 after surging above 35 on Tuesday. According to the CNN Business Fear & Greed Index, greed is once again the prevailing emotion driving markets. ", "Kevin Giddis, managing director at Raymond James, said that whether the positive sentiment \"holds, or gains momentum, is anyone's guess.\" Of course, volatility will return at some point. The question for investors is when — and what will provide the trigger. ", "In Europe, where the number of coronavirus cases is surging and trade talks between the European Union and the United Kingdom are at risk of collapsing, investors are keeping a close watch on the central bank.", "The European Central Bank will issue its latest decision on Thursday, and President Christine Lagarde will hold a press conference. Investors will be looking for signs the bank could turn the stimulus tap back on following a sharp rise in the euro against the dollar.", "There is also some positive economic data to consider. Industrial production figures for France and Italy confirmed a continued recovery in July, although output levels remain depressed compared to a year ago", "In the United States, investors will have new labor market data to consider. Economists predict that another 846,000 Americans filed initial claims for unemployment benefits last week.", "That would be an improvement from 881,000 claims filed in the previous week, and a sign that the job market is recovering. In recent months, there have only been two weeks when claims came in under 1 million.", "The big picture: The US economy is operating at 79% of where it was in early March, according to The Back-to-Normal Index from Moody's Analytics and CNN Business.", "Looking further ahead, the Federal Reserve will next week hold its final meeting before the US election. Economists don't expect major fireworks, but every utterance from the central bank matters in this environment. ", "\"The market's hope for next week's Fed meeting is likely going to be about continued guidance. Specifically, how far will the Fed let inflation rise before it moves in to tighten or take the punchbowl away?\" said Giddis.", "US warns climate change could create economic chaos", "The far-reaching consequences of climate change have the ability to create chaos in the financial system and disrupt the American economy, according to a new report from the US government.", "The report, which is the first of its kind from the government, calls for Congress to swiftly impose a price on carbon and urges financial regulators to \"more urgently and decisively\" work to understand and blunt the looming economic damage, reports my colleague Matt Egan.", "\"Climate change poses a major risk to the stability of the US financial system and to its ability to sustain the American economy,\" the US Commodity Futures Trading Commission's climate subcommittee wrote.", "The CFTC climate subcommittee laid out 53 recommendations for dealing with the climate risk, including requiring companies to disclose details on greenhouse gas emissions, piloting climate stress tests, and forcing banks to address climate change financial risks.", "The report also urged regulators to incorporate climate risks into their mandates, including the Financial Stability Oversight Council, which is charged with identifying emerging threats to financial stability.", "\"Financial markets today are not pricing climate risk. The financial markets cannot do that on their own,\" Bob Litterman, chairman of the CFTC climate subcommittee, said in the report. \"Until this fundamental flaw is fixed, capital will flow in the wrong direction.\"", "Lawmakers and industry leaders have debated a price on carbon, such as a carbon tax, for decades. Even some large fossil fuel companies such as ExxonMobil (XOM) support a carbon tax. Europe has had a carbon trading system for over a decade.", "Getting into wind: On Thursday, BP said it's moving into offshore wind power for the first time with a $1.1 billion investment in the United States.", "BP (BP) said in a statement on Thursday that it will buy a 50% stake in Equinor's Empire Wind and Beacon Wind projects on the east coast. Together, they have the potential to power more than 2 million American homes.", "The context: BP unveiled a major strategic overhaul last month to deliver on its promise of net zero emissions by 2050. The company plans a 10-fold increase in annual low carbon investments to $5 billion by 2030, when it expects its oil and gas production to have fallen by 40% on 2019 levels.", "These companies are capitalizing on the athleisure boom", "Consumers are swapping out jeans and officewear for yoga pants, sweats and shorts as they work from home and spend more free time there. ", "That's great news for retailers of athleisure, the casual clothing designed for workouts and everyday wear, reports my colleague Nathaniel Meyersohn ", "A few caveats: It's not clear how long people will continue to pay up for items like expensive leggings, shorts and tanks. And the pandemic is driving up costs at some retailers.", "Despite closing stores temporarily because of the pandemic, Lululemon said Tuesday that sales increased 2% to $903 million during the quarter ending August 2, compared with the same period last year. Rising costs pushed net income down to $86.8 million, a decline of 31% from a year earlier. ", "\"We are seeing a shift in behavior in terms of working from home, sweating from home and the increased importance of living an active and healthy lifestyle. These trends play to our strengths,\" CEO Calvin McDonald said.", "Other winners: Athleta, the athleisure label at Gap, saw sales increase 6% during its latest quarter, despite Gap's sales falling. PVH, the parent of Tommy Hilfiger and Calvin Klein, said athleisure clothing was one of its strongest sellers during its latest quarter. And Dick's Sporting Goods said consumers were gravitating to athletic attire.", "Up next", "Initial unemployment claims will be published at 8:30 a.m. ET.", "Also today:", "Oracle (ORCL), Chewy (CHWY) and Peloton earningsEuropean Central Bank meeting and press conference", "Coming tomorrow: US inflation data; Kroger (KR) earnings"]}