{"url": "https://edition.cnn.com/2020/09/09/investing/tesla-stock-news-september/index.html", "title": "4 insane things just happened to Tesla", "article": ["It kicked off the month with a massive stock sale, seen its fortunes dwindle (and slightly recover) and grin and bear a notable snub from the S&P 500. ", "Let's take a ride through Tesla's and CEO Elon Musk's adventurous month so far: ", "1. Stock slump", "Tesla (TSLA), one of the best-performing US stocks this year, endured its worst trading day since it went public 10 years ago on Tuesday. ", "Shares of Tesla lost 21% of their value after Standard & Poor's declined to add it to its index of 500 major US stocks. Being added to the index would have required portfolio managers who mirror the index to buy additional shares. Part of the rise in Tesla shares in recent months was on anticipation that it would get added to the prestigious index.", "Tesla's market value dropped by roughly $80 billion Tuesday. That's more than the combined market cap of Ford (F) and General Motors (GM).", "Tuesday's 21% tumble edged out the company's 19% slide in January 2012, less than two years after its initial public offering. The company's third- and fourth-largest one-day drops came when it lost nearly 19% on March 16, and 17% on February 5 of this year. The stock rebounded nicely from each of those sell-offs.", "And that appears to be happening Wednesday: The stock closed 11% higher and is up nearly 340% for the year.", "2. More competition", "It might seem like Tesla is the only electric vehicle company with all the coverage, but there are others. For example, General Motors is teaming up with Nikola to work on the Nikola Badger, a fully electric and hydrogen fuel cell electric pickup truck.", "The partnership gives General Motors an 11% stake in the startup, receiving $2 billion in equity, the companies said Tuesday. GM will also get the right to nominate one director to Nikola's board. Nikola shares closed 40% higher following the news.", "3. Stock sale", "On September 1, Tesla announced plans to sell up to about $5 billion in new shares., a day after it split its stock that cut the price of each share by a fifth. Days later, on September 8, it announced it had completed that sale. The exact number of shares sold, and thus the average price of each sale, was not disclosed.", "Tesla didn't give many specific details about what it plans to do with the money from the stock sale, simply saying in a regulatory filing that it intends to use the proceeds \"to further strengthen our balance sheet, as well as for general corporate purposes.\"", "4. S&P 500 snub", "S&P Dow Jones Indices announced on September 4 it's adding three new companies — none of which were Tesla, the most valuable automaker on the planet.", "The S&P 500 index is one of the most important stock market indices, considered a key benchmark tracking the success of America's largest publicly traded companies. ", "Despite losing about $100 billion in market cap since then, Tesla is still worth more than Toyota, Disney and Coca-Cola. \"In a nutshell Tesla not getting into the S&P 500 will be a head scratcher to the bulls that viewed this as virtually a lock given all the parameters met,\" Wedbush analysts wrote in a note. ", "-- CNN Business' Annalyn Kurtz, Paul R. La Monica and Chris Isidore contributed to this report."]}