{"url": "https://edition.cnn.com/2020/09/09/investing/premarket-stocks-trading/index.html", "title": "When massive central bank stimulus isn't enough", "article": ["A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.", "But there must be — at some point — limits. On Tuesday, US stocks dropped sharply after prices reached the limit of what investors appeared able to stomach. The sell-off in tech shares was particularly brutal.", "US futures suggest a rebound on Wednesday, but a number of risks could continue to draw more attention from investors. Economies around the world remain weak, and the coronavirus pandemic continues to rage. Analysts worry that the results of the US election may be contested.", "Kit Juckes, a strategist at Societe Generale, told clients on Wednesday that the second week of September often sets the tone for the rest of the year. If that holds true, he warned, \"it's going to be grim.\"", "\"It does a feel a bit as though markets got drunk on easy money and are waking to a hangover, geo-politics, and policymakers' nervousness about the size of the debt load they've taken on,\" he said. ", "More pain to come? The big question is whether stocks — tech shares, in particular — have more room to fall, according to Stephen Innes, chief global markets strategist at AxiCorp.", "\"We are bearing witness to the most unvirtuous circle of events in some time as everyone seems to be running for cover,\" he said.", "Tesla (TSLA) was hit particularly hard on Tuesday, suffering its biggest stock decline since the company went public 10 years ago. ", "Shares lost 21% of their value after Standard & Poor's declined to add Tesla to its index of 500 major US stocks. Inclusion would have required portfolio managers who track the index to buy additional shares in the carmaker. ", "Some perspective: Tesla's market value dropped by roughly $80 billion. That's more than the combined market cap of Ford and General Motors.", "Even with the huge decline Tuesday, Tesla shares have nearly quadrupled in value so far this year. The stock is down 34% since reaching a record high close on Aug. 31.", "Oil prices collapse after Saudi Arabia sends ominous signal", "Demand fears are once again rippling through the oil market, my colleague Matt Egan reports from New York. ", "US oil prices plunged 7% on Tuesday to $36.76 a barrel. It was crude's worst day and lowest closing price in nearly three months. At one point, oil was down as much as 9%. Brent crude, the world benchmark, fell below $40 a barrel for the first time since late June.", "Prices made a modest rebound on Wednesday, but there are still concerns about how much crude the fragile world economy needs. The summer driving season in the United States is over, and jet fuel demand remains extremely weak because many people don't want to fly during the pandemic.", "The bottom line: No one knows how long it will take demand to recover.", "The selloff came after Saudi Arabia, the de facto leader of OPEC, slashed its official selling price to Asia and the United States, Bloomberg News reported. It's never a good sign when the world's leading oil exporter feels compelled to cut prices to draw buyers.", "\"Oil demand globally is really sluggish. All of the low hanging fruit from the global oil recovery has already happened,\" said Michael Tran, managing director of global energy strategy at RBC Capital Markets.", "US companies are sticking with China", "American companies in China are increasingly pessimistic about trade tensions between Washington and Beijing. But very few want to uproot their business in the world's second biggest economy, my colleague Michelle Toh reports from Hong Kong.", "Survey says: Some 92% of respondents to a survey released Wednesday by the American Chamber of Commerce in Shanghai said they were committed to remaining in the country even as the US-China relationship continues to fracture.", "More than a quarter of the US firms surveyed said that they expected US-China trade tensions to last \"indefinitely,\" compared to about 17% a year ago. Meanwhile, about a fifth of respondents said they expected the tensions to last for three to five years. Only around 14% of companies said they thought the issue would be resolved within a year.", "The real world consequences: Some 32% of survey respondents said that the souring US-China relationship is affecting their ability to retain staff in China. Some businesses also said they would lower investment in the country due to uncertainty about trade issues.", "Up next", "American Eagle (AEO) reports earnings before the open. GameStop (GME) will follow after the closing bell.", "Also today:", "The US Energy Information Administration publishes its report on crude inventories at 10:30 a.m. ET. ", "Coming tomorrow: US initial unemployment claims; Chewy and Peloton earnings; European Central Bank meeting"]}