{"url": "https://edition.cnn.com/2020/09/09/investing/david-beckham-guild-esports/index.html", "title": "David Beckham is taking his esports company public in London IPO", "article": ["Guild Esports, a UK-based owner and developer of esports teams, confirmed plans for an initial public offering in a statement Wednesday. The company said it wants to build a global sports franchise modeled on the English Premier League, NBA and NFL. It will float 40% of its shares next month and hopes to raise £20 million ($25.9 million) to recruit new players and invest in the business.", "Electronic sports features multiple professional players competing in video games that can be watched at physical venues or through digital channels. A stock market listing will provide Guild Esports \"with the caché, credibility and capital\" to fulfill its ambition to become one of the world's top 10 esports franchises within three years, executive chairman Carleton Curtis said in the statement. ", "Beckham, a former Manchester United and England footballer, will use his global influence and following to support the Guild Esports brand, the company added. Beckham is also co-owner of Inter Miami CF, a Major League Soccer team in the United States. ", "The popularity of esports has surged in recent years, reaching a worldwide audience of nearly 500 million and revenues of almost $1 billion in 2019, according to gaming analytics company Newzoo. Some esports events, such as the 2017 League of Legends championship, attracted more viewers than tournaments such as Wimbledon, the US Open and the Tour de France.", "\"The growing global popularity of esports has enabled several existing franchises to monetize their activities through sponsorship, retail, merchandising... broadcasting and tournaments,\" added Curtis. ", "Guild Esports hopes to do the same, capitalizing on a fan base that has only increased during the pandemic, as people found new forms of in-home entertainment during lockdowns and regular sports tournaments were either placed on hold or held behind closed doors. ", "The company plans to recruit up to 20 esports players by the end of next year, modeling player training and scouting on the talent academies pioneered by Premier League football teams.  ", "It initially plans to field teams to compete in Fortnite, Counter-Strike: Global Offensive, Rocket League and FIFA. "]}