{"url": "https://edition.cnn.com/2020/09/14/investing/premarket-stocks-trading/index.html", "title": "TikTok has found a partner. It's not a done deal yet", "article": ["A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.", "What's happening: TikTok and Oracle (ORCL) will become business partners in the United States, a person familiar with the matter told CNN Business. The news follows weeks of speculation about the Chinese video app's future after President Donald Trump threatened to shut down its US operations unless parent company ByteDance orchestrated a sale.", "Meanwhile, Nvidia announced Sunday that it's buying British chipmaker ARM from SoftBank for as much as $40 billion. That would make it the largest semiconductor deal ever.", "But both deals are due to draw serious scrutiny from political leaders determined to ensure that their countries aren't giving up crucial technological expertise.", "Watch this space: Experts have warned that a recent rule change in China could force ByteDance to obtain government permission before selling TikTok to a foreign company. Chinese state media on Monday reported that ByteDance would not sell TikTok's US operations to Oracle or Microsoft, which was also pursuing a bid. State broadcaster CGTN added that ByteDance would not \"give the source code\" to any US buyers.", "The exact nature of the agreement between TikTok and Oracle remains unclear, but it was not described as an outright sale.", "It's also not clear whether the Trump administration, which has said that the app poses a threat to national security, will give its seal of approval.", "The Nvidia deal for ARM, which designs chips for companies like Apple and is one of Britain's most successful tech firms, could also prove controversial. Before closing, the deal requires regulatory approval from the United Kingdom, the European Union, the United States and China. Nvidia said Sunday that it plans to keep ARM's headquarters in Cambridge.", "The BBC reports that the UK government will not move to block the sale, but that it could impose conditions on the takeover, citing a senior government source.", "While geopolitical concerns are factoring more heavily into dealmaking, the flurry of mergers and acquisitions is expected to continue through September as companies aim to squeeze in announcements before the US election introduces any more market volatility.", "Another one: Gilead Sciences (GILD) said Sunday that it will scoop up Immunomedics for $21 billion to expand its portfolio of cancer treatments.", "Has the drop in tech stocks come to an end?", "It's hard to say for sure, but some on Wall Street think the correction in tech stocks that shook markets in recent weeks could be coming to a close.", "The latest: Goldman Sachs is telling clients that it's sticking to its year-end outlook despite the \"warp speed\" pullback, which has pushed the Nasdaq Composite down nearly 10% from its recent high on Sept. 2. The S&P 500 kicks off the week 6.7% below its recent peak.", "\"Despite the sharp sell-off in the past week, we remain optimistic about the path of the US equity market in coming months,\" strategists including David Kostin said late Friday.", "Deutsche Bank, meanwhile, pointed out that options positioning that had added to selling pressure has normalized. The CBOE Nasdaq 100 Volatility Index, which tracks market sentiment, remains slightly elevated, but is back near where it started the month.", "Both Goldman Sachs and Deutsche Bank warned that the election could introduce more turbulence in the weeks to come, however.", "\"In the near term, the biggest source of uncertainty is Election Day,\" Goldman's analysts said.", "BP calls the end of booming oil demand", "Demand for oil may have peaked last year, according to BP, which warned on Monday that the global market for oil might never recover from the coronavirus pandemic, my CNN Business colleague Hanna Ziady reports.", "What's new: BP (BP) laid out three scenarios for energy demand in a new report, all of which forecast a decline in demand for oil over the next 30 years.", "If government policies and social preferences evolve in the same way as in the recent past, oil demand ticks up slightly in the years to come before starting to decline after 2030.", "But in two other scenarios, in which governments take more aggressive steps to curb carbon emissions and there are significant shifts in societal behavior, demand for oil never fully recovers from the fall caused by the coronavirus. That would mean oil demand peaked in 2019.", "Why it matters: It's a big call from one of the world's top oil producers and signals just how much has changed in the past six months.", "Last year, BP expected growth in oil demand to plateau in the 2030s. But the pandemic has had a profound effect on global energy markets, accelerating a shift away from fossil fuels toward renewable forms of energy.", "BP is leaning into that shift, unveiling a new strategy earlier this year. Competitors like ExxonMobil (XOM), however, have doubled down on oil and gas in recent years, causing investors to worry they're on the wrong path.", "Up next", "British lawmakers are due to hold the first substantive debate on a controversial bill that would breach parts of the already-signed withdrawal agreement with the European Union. What happens next could have major consequences for business.", "Coming tomorrow: FedEx (FDX) reports earnings."]}