{"url": "https://edition.cnn.com/2020/09/13/investing/stocks-week-ahead/index.html", "title": "The Federal Reserve preps for its final meeting before the election", "article": ["A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.", "What's happening: Fed officials convene for their final meeting before November's election on September 15 and 16. The central bank is expected to set new economic and interest rate projections that run through 2023. It may also put more meat on the bones of a new strategy, unveiled last month, under which it could let inflation run higher to help the economy recover.", "Andrew Smith, chief investment strategist at Delos Capital Advisors, thinks this is a \"seismic shift\" in the Fed's approach to inflation to which the market is not paying enough attention. \"We believe it's important for the Fed to provide clear and substantive guidance on this new approach given the ever-increasing role monetary policy has held within the financial system,\" he told CNN Business.", "The central bank has already shored up the economy, and with it President Donald Trump's reelection prospects, by slashing interest rates near zero and buying trillions of dollars worth of bonds.", "Now, there's not a whole lot more the Fed can do to get help to the people who need it most (and who will be voting in November).", "That could be a problem for Trump, who would love to tout rising stock markets and falling jobless claims during the final weeks of the campaign.", "Already, the effectiveness of government spending appears to be wearing off, as bankruptcies surge, and America's jobs recovery may be stalling.", "See here: Nearly 90% of 860 small business owners surveyed by Goldman Sachs have exhausted their funding from the Paycheck Protection Program and expect to lay off more workers in the coming months.", "But, back to central bank policy: The Fed published an updated strategy late last month that was thin on detail but suggested it will be comfortable letting inflation run a little above its 2% target going forward, given that it's been persistently below that level for some time.", "It also changed the way it defines its congressional mandate to promote employment, making it more inclusive and therefore beneficial to low- and moderate-income groups. \"Research shows that these groups get disproportionate gains from very low unemployment rates,\" according to the Brookings Institution.", "These changes suggest the central bank is thinking for the first time about whether monetary policy can be used as a tool to tackle inequality, said Laura Veldkamp, a finance professor at Columbia University's Graduate School of Business.", "This week we'll get the first glimpse of how the changes will play out in practice, including how important a consideration inequality might be in monetary policy debates relative to traditional factors such as the threat of inflation and economic weakness, Veldkamp said.", "Market watcher: While the market is not anticipating any changes to interest rates or major new fiscal stimulus, investors will still be looking for clues on how the Fed plans to steer the economy.", "\"In a situation where you know so little, new pieces of information are really valuable and you react really strongly to them,\" Veldkamp added.", "How strong is the coronavirus recovery?", "It promises to be another important week for the global economy, with a string of data releases that will give a sense of the pace and shape of the recovery.", "Market participants are struggling to predict how quickly businesses and consumers will return to normal, with signs that rebounds over the summer may be losing momentum. Coronavirus cases are also on the rise across much of Europe, leading to fresh restrictions on travel and gatherings in several countries.", "Early warning: The Organization for Economic Cooperation and Development warned about a second wave back in June, when it published the gloomiest prediction among multilateral institutions, forecasting a 6% contraction in global GDP this year. The Paris-based agency will publish a fresh outlook for the global economy on Wednesday.", "Oil demand could provide some insight into the recovery. The International Energy Agency will release its monthly oil market report for August on Tuesday. The agency last month reduced its demand forecast for this year and next, mainly due to aviation sector weakness.", "Any signs of weakening demand could knock Brent crude, which this week dropped below $40 a barrel for the first time since June.", "The Bank of England and Bank of Japan will also hold policy meetings this week, although economists expect little action this round.", "One point of interest: It will be the BoJ's first meeting since Prime Minister Shinzo Abe announced his resignation late last month.", "\"With a big job still left to do to pull Japan out of its Covid-19 induced recession, this is obviously a difficult time for a change in prime minister,\" said ING's regional head of Asia Pacific research, Robert Carnell. \"But we would caution against thoughts that this will usher in some even easier policy from the Bank of Japan.\"", "Up Next", "Monday: Lennar (LEN) earnings", "Tuesday: US industrial production; UK unemployment; Adobe and FedEx earnings; China industrial production and retail sales", "Wednesday: Federal Reserve meeting; US retail sales; OECD interim outlook; Japan trade data", "Thursday: Bank of England and Bank of Japan meetings; Ryanair AGM", "Friday: UK retail sales"]}