{"url": "https://edition.cnn.com/2020/09/13/investing/sp-500-apple-amazon-microsoft-alphabet-facebook/index.html", "title": "There's a hidden weakness in the stock market ", "article": ["Sure, the S&P 500 is up about 3% so far this year. That's not bad, especially given all the volatility in the market and the  severe slump in the economy since March because of coronavirus. ", "However, the index is is weighted by market value. That means that the strong performances of the five tech giants that dominate the blue chips -- Apple (AAPL), Amazon (AMZN), Microsoft (MSFT), Google owner Alphabet (GOOGL) and Facebook (FB) -- distort the S&P 500's overall return.", "It's one reason some half-jokingly refer to the S&P 500 as the \"S&P 5.\" ", "But the index tells a different story when you look at the many other stocks in the S&P 500. An Invesco S&P 500 ETF (RSP) that equally weights all of the index members is down more than 6% this year. ", "Market not as strong without the Fab 5 of tech", "Nearly 60% of the companies in the index were in the red for 2020 through Thursday's close, according to data from Refinitiv.", "\"Without Big Tech's influence, the broad market would not look quite as stable as it does today,\" analysts from Zacks Investment Research said in a report last week.", "The over-reliance on this tech quintet could become a problem if Congress and the president (whether it's Donald Trump in a second term or Joe Biden) decide to impose tougher regulations on or launch specific antitrust investigations against industry leaders sometime after the election.", "\"Though Congress is not likely to pass any meaningful legislation this year, there appears to be growing consensus that the current course for Big Tech is not sustainable. From an investment standpoint, the suggestion is that long-term outperformance may not be sustainable, either,\" the Zacks analysts wrote.", "International stocks have more momentum lately", "The strong gains of the top techs also make it look like the US market is doing better than international stocks. But dig deeper and that too is untrue.", "Strategists from Schwab (SCHW) recently noted that if you exclude the 5 giant tech stocks and compare the S&P 500 only to international stocks, foreign companies have actually done slightly better than the US market over the past three months. ", "The alphabet-soup-named SPDR MSCI ACWI ex-US ETF (CWI), which holds top international companies such as Alibaba (BABA), Tencent (TCEHY), Nestle (NSRGF), Taiwan Semiconductor (TSM) and Roche (RHHBF), is up nearly 5% since mid-June while the equal weighted S&P 500 ETF is up less than 1%.", "\"The outperformance by the biggest US stocks is hiding a change in leadership by the average stock: The average international stock has been outperforming the average US stock,\" said Jeff Kleintop, chief global Investment strategist for Charles Schwab, in a report. ", "\"The recent imbalances in the stock market can lead to vulnerability,\" he added.", "Even Warren Buffett appears to be signaling that he's finding more value abroad. The Oracle of Omaha's Berkshire Hathaway (BRKB) recently bought stakes in five top Japanese trading firms.", "\"The fact that the world's most famous investor has committed to such large sums has ramifications for both domestic and international perceptions about Japanese equities,\" said John Vail, chief global strategist at Nikko Asset Management, in a report.", "Vail thinks the Berkshire endorsement \"marks a true turning point\" for Japanese stocks. He said that bears no longer have a good argument for their skepticism. ", "\"No one will be able to speak quite as dourly, as the retort should typically be, 'But Buffett Disagrees,'\" Vail said."]}