{"url": "https://edition.cnn.com/2020/09/11/investing/nfl-football-legal-gambling/index.html", "title": "Are you ready for some football? Gamblers are rejoicing", "article": ["Sports betting is now legal in 18 states following a 2018 US Supreme Court ruling. In some states, gamblers now can bet via mobile apps, while others allow customers to place bets at physical sportsbooks at casinos or racetracks.", "Momentum is also growing for even more states to legalize sports gambling in light of the fiscal strain many local governments face due to the coronavirus pandemic.", "\"Municipal coffers are not seeing as much tax revenue. There are holes in budgets due to Covid so we're optimistic about more states approving sports betting,' said Mike Raffensperger, chief marketing officer of FanDuel, which is owned by UK-based Flutter Entertainment (PDYPF).", "The legitimization of sports betting, bringing it to the mainstream as opposed to people making illicit bets with bookies in bars, should lead to even more Americans willing to wager on football games. ", "The American Gaming Association's CEO Bill Miller told CNN Business that about 13% of American adults — nearly 35 million people — will bet on the NFL this season.", "Online gambling companies are doing all they can to grab a piece of this pie, including gimmicky offers during the first week of the season to lure more gamblers.", "Wacky wagers to attract even more customers", "DraftKings, for example, let people bet on the Super Bowl champion Kansas City Chiefs Thursday night as a 101-point underdog. ", "The only way to have lost that bet was if the Houston Texans defeated them by 102 points -- a virtual impossibility. DraftKings CEO Jason Robins told CNN Business that the company paid out $20 million to gamblers who took that bet. (The Chiefs won by 14 points, by the way.)", "And FanDuel has a crowdsourced promotion for Sunday night's Los Angeles Rams-Dallas Cowboys game. With every 5,000 bets, the point spread will move one point for the Rams. The Rams are currently a 3.5 point underdog but could wind up being a 40 or 50 point underdog, making a bet on LA a near lock to win. ", "AGA CEO Miller said he expects the betting companies to also tout more in-game betting in order to generate more revenue and keep fans interested in watching games — even ones that aren't competitive. ", "Typically, gamblers make bets before a game begins and the wager depends on the final outcome. But the rise of mobile betting apps could make it easier for someone to, for example, make a bet in the second half of a game that is just about what happens in the final two quarters.", "\"As the season moves along, people may become more comfortable with in-game betting on different propositions,\" Miller said.", "Casinos ramping up their online betting apps", "DraftKings and FanDuel are in a fierce battle to attract more gamblers. The two are the market leaders in most of the states they operate in. Morgan Stanley estimated this May that FanDuel had a 43% market share in New Jersey while DraftKings had 38% of the Garden State's gamblers.", "And the competition is sure to get more intense. Casino owner Penn National Gaming (PENN) is getting ready to launch its own sports betting app through a partnership and big investment in Barstool Sports.", "Las Vegas-based MGM Resorts (MGM), owner of the famed Mirage and Bellagio on the Sin City Strip, also has its BetMGM online sportsbook. ", "Jason Scott, vice president of trading for BetMGM, told CNN Business that he realizes FanDuel and DraftKings have a head start in betting thanks to their legacy customers for fantasy sports games.", "But Scott added that the online gambling business is big enough for multiple players, and he noted that a recent investment from Barry Diller's IAC (IAC) could help MGM grow its digital operations even further. ", "Still, the biggest concern for the gambling companies isn't attracting more bets and new customers. It's whether the NFL will be able to complete a full season without coronavirus disruptions.", "DraftKings CEO Robins is confident, noting that the NFL had the benefit of starting up after major league baseball began playing its delayed, shortened season and basketball and hockey resumed their playoffs.", "\"Certainly there are risks, but the hope is that the NFL planned well and watched other sports to see what worked and had hiccups,\" Robins said. \"The key thing is that games, even if postponed, eventually get played.\"", "Robins added though that betting on other sports could help pick up the slack of any lost NFL revenue. DraftKings is already preparing for fewer bets on college football too as some conferences have delayed or canceled fall games.", "But Yaniv Sherman, head of commercial development at 888 Holdings, an online casino and sports betting company, said it is critical that the NFL finishes its entire season. He said that pro football still  makes up the bulk of US legal betting. ", "\"I'm worried. The NFL pulling the plug would be catastrophic. It's the biggest and most successful league,\" Sherman said. \"If the NFL had to cancel games, it would mean the situation is really grave.\"", "Investors are wagering on continued success for the sports betting companies, too. DraftKings shares are up 300% this year while Penn National's have more than doubled."]}