{"url": "https://edition.cnn.com/2020/09/11/investing/premarket-stocks-trading/index.html", "title": "The easy recovery is over", "article": ["A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.", "All good? Not exactly.", "The growth was slightly slower than in June, when the pace of expansion was 8.7%. And economists say that future gains will be much harder to come by.", "\"July was probably the last of the big step ups in activity and a full recovery probably won't be achieved until early 2022,\" said Thomas Pugh, UK economist at Capital Economics. ", "The trend could be replicated in other large economies around the world. The end of severe lockdowns causes growth to surge in the third quarter but continued social distancing limits further gains as the year draws to a close.", "Storm clouds are already gathering in the United Kingdom. The country was forced this week to tighten social distancing rules following a surge in coronavirus cases. A government wage subsidy program is scheduled to end in October, and there is chatter about tax hikes to pay for huge stimulus.", "If that weren't enough, negotiations with the European Union on a new trade deal are at risk of collapse after Prime Minister Boris Johnson announced plans to invalidate parts of the Brexit divorce agreement.", "A disorderly break with the country's largest export market could cause massive disruption at its borders, plunge supply chains into chaos and further damage the economy.", "\"The tailwinds to growth are fading while GDP remains highly depressed and new headwinds to growth are blowing,\" said economists at BofA.", "The bottom line: The UK economy could be headed for a double-dip recession. BofA thinks that will be avoided, but only because people and businesses may be forced to stockpile ahead of the Brexit deadline. ", "Another vantage: The UK economy was still 11.8% smaller in July than it was in January, even after the lockdown was dramatically eased. That's much worse than any other recession over the past 50 years. ", "Meanwhile, in America: The US economy is operating at 79% of where it was in early March, according to The Back-to-Normal Index from Moody's Analytics and CNN Business.", "Dozens of Amazon products reported as dangerous", "AmazonBasics products are the focus of an investigation by my colleagues Blake Ellis and Melanie Hicken. What they found is alarming ", "Consumers have raised serious safety concerns about AmazonBasics items in complaints to government regulators and in reviews posted on Amazon's own website. Since 2016, at least 1,500 reviews, covering more than 70 items, have described products exploding, catching on fire, smoking, melting, causing electrical malfunctions or otherwise posing risks.", "The reviews represent a small fraction of the overall purchases of the products, and fires caused by consumer electronics are not unique to Amazon branded items. User error can also be a factor. But when well-made and used properly by consumers, such electronics should rarely pose dangers, said electrical engineers interviewed by CNN.", "Read the full story for much more.", "Amazon's response: The retailer said \"safety is a top priority\" at the company and that it takes a number of steps to ensure all AmazonBasics products are safe and high quality, such as selecting experienced manufacturers, monitoring customer feedback and testing items to ensure they pass safety and compliance standards.", "The Fortune 500 has a record number of women CEOs", "Citigroup has hired Jane Fraser as its next CEO, the first woman to lead a major US bank and the 39th female chief executive on the Fortune 500 list.", "The history-making announcement on Thursday from Citigroup elevates Fraser from her current role leading Citi's consumer bank.", "A very long way to go: Fraser joins just 38 other women on the largely white and male Fortune 500 CEO list, Alexis Benveniste reports from New York. ", "The figure is inching up, but women still represent only 7.8% of the Fortune 500 CEO list, highlighting the slow pace of change.", "A tiny fraction — less than 1% — of Fortune 500 companies have Black CEOs. And only three women on the list of Fortune 500 female CEOs are women of color, according to Fortune.", "Those women are Sonia Syngal, the CEO of Gap Inc., Lisa Su, the CEO of Advanced Micro Devices and Joey Wat, the CEO of Yum China.", "Up next", "Kroger earnings are out before the opening bell.", "Also today:", "US inflation data for August will be published at 8:30 a.m. ET", "Coming next week: The US Federal Reserve meets for the final time before the election."]}