{"url": "https://edition.cnn.com/2020/09/10/investing/oil-price-slump-texas-jobs/index.html", "title": "Slumping energy prices translate to layoffs and bankruptcies for Texas oil country ", "article": ["Now he's been forced to close his doors and let his workers go. His business was a victim of the plunge in oil prices, caused by a severe dropoff in demand during the Covid-19 pandemic and price war sparked by Saudi Arabia and Russia. Immediately after the Dow crashed more than 2,000 points on March 9, Bound lost half a million dollars in active jobs.", "\"It's kind of a slow death. You know, you start laying people off and finishing up the work you have and hoping the phone would ring,\" he said. ", "The Petroleum Equipment & Services Association estimates 103,420 jobs have been lost since the pandemic started, as dozens of producers and service providers have gone out of business. The industry, once booming, wasn't in a good place even before Covid struck. Companies were struggling to stay afloat and looking to merge, burdened by high levels of debt in a global energy market flooded with supply.", "America is now producing 3 million fewer barrels per day than it was in March. That sharp contraction means companies don't need many workers or service providers like Bobby Bounds.  ", "The real tragedy Bounds said isn't his business, but the skilled workers he had to lay off.  \"They're standing there in front of me and they can't feed their kids. They can't pay their rent,\" said Bounds.", " ", "The crisis is particularly acute in Midland, the heart of the US shale industry. Midland's unemployment rate has risen nearly five-fold in a year, from 2% to 9.4%, according to figures from the Texas Workforce Commission. In neighboring Odessa, it is at 13%, the highest in the state. ", "\"As the industry continues to follow this path of consolidation, there are layoffs with every transaction,\" said Jeff Bush, the President of CSI Recruiting. Hiring is much quieter than in years past and it is especially tough finding new roles for those with expertise in drilling or land rights, since firms aren't doing new exploration or development. ", "\"[Companies] are not looking for new places to drill, since we don't even have the inclination to drill what we've already got,\" he said. He expects it to be slow for the next few years.  ", "Corey Wood is one of those hunting for work in the industry. After graduating from Texas A&M in 2017 with a degree in petroleum engineering, he landed a job at oil and gas producer Lillis Energy. The company filed for Chapter 11 Bankruptcy in June, after prices collapsed. Wood got laid off. ", "\"I got a check when I walked out the door for my vacation days, that was just about it,\" he said.", "Wood's living on unemployment and looking for new work. Despite the downturn, he's optimistic. He's had three interviews and he really wants to stay in the energy industry. ", "\"I have seen quite a few people my age move out of the industry or go back to business school. What's making me want to stay? I really enjoyed my job. The industry as a whole is really supportive,\" he said.  ", "Even the bigger industry players are cutting back. Pioneer Natural Resources sits on the region's largest shale assetsas an independent producer. CFO Richard Dealy said the company is aggressively cutting costs and preparing for energy demand to remain stagnant until there is a Covid-19 vaccine. ", "\"The world doesn't need a million barrels a day of growth coming from the US,\" said Dealy. \"We'll have to adjust our staffing levels down to rightsize it to our activity levels and we're still in the middle of that process right now.\"", "For Bobby Bounds, this downturn looks worse than the boom and bust cycle of years past. He's packed up and left Texas for New Mexico, where he has started a new company doing industrial cleaning. ", "\"When you're totally dependent on one industry, then that industry collapses. You don't have a business,\" Bound said. "]}